<?php

return [

    'footer'        => 'الرجوع إلى <a href="' . route('admin.dashboard.index') . '">لوحة  التحكم</a>',

    '404_page'      => [
        'title'     => 'الصفحة غير موجودة !!',
        'header'    => '404 - الصفحة غير موجودة',
        'message'   => 'ربما تكون الصفحة التي تبحث عنها قيد الإنشاء أو غير موجودة.',
    ],

    '403_page'      => [
        'title'     => 'صفحة ممنوعة !!',
        'header'    => '403 - ممنوع',
        'message'   => 'غير مسموح لك بالوصول إلى هذه الصفحة.',
    ],

    '401_page'      => [
        'title'     => 'غير مصرح !!',
        'header'    => '401 - غير مصرح',
        'message'   => 'يجب تسجيل الدخول للوصول إلى هذه الصفحة.',
    ],

    '419_page'      => [
        'title'     => 'انتهت صلاحية الصفحة !!',
        'header'    => '419 - انتهت صلاحية الصفحة',
        'message'   => 'انتهت صلاحية جلستك. يرجى تحديث الصفحة والمحاولة مرة أخرى.',
    ],

    '429_page'      => [
        'title'     => 'طلبات كثيرة جدًا !!',
        'header'    => '429 - طلبات كثيرة جدًا',
        'message'   => 'لقد أرسلت عددًا كبيرًا من الطلبات في وقت قصير. يرجى الانتظار قليلًا والمحاولة مرة أخرى.',
    ],

    '405_page'      => [
        'title'     => 'الطريقة غير مسموحة !!',
        'header'    => '405 - الطريقة غير مسموحة',
        'message'   => 'الطريقة التي تحاول الوصول إليها غير مسموحة.',
    ],

    '500_page'      => [
        'title'     => 'خطأ في الخادم !!',
        'header'    => '500 - خطأ في الخادم',
        'message'   => 'عفوًا، حدث خطأ ما من جانبنا. نحن نعمل على حل هذه المشكلة في أسرع وقت.',
    ],

    '503_page'      => [
        'title'     => 'الخدمة غير متوفرة !!',
        'header'    => '503 - الخدمة غير متوفرة',
        'message'   => 'عذرًا، نحن حاليًا في وضع الصيانة. يرجى التحقق مرة أخرى في وقت لاحق.',
    ],
];
